[
  {
    "id": "2",
    "word": "dismal",
    "word_meaning": "causing gloom or misery",
    "difficulty_level": "easy",
    "passages": {
      "15": "The dismal weather, with gray skies and constant drizzle, ruined our weekend picnic plans.",
      "30": "For three days straight, the dismal weather lingered, the sky heavy with clouds, and the streets nearly empty, as if the whole town had surrendered to a shared sense of gloom."
    }
  },
  {
    "id": "3",
    "word": "brisk",
    "word_meaning": "quick and energetic",
    "difficulty_level": "easy",
    "passages": {
      "15": "She took a brisk walk to the market, enjoying the cool morning air.",
      "30": "She set off on a brisk walk to the market, weaving through narrow lanes, her scarf fluttering, as the shopkeepers opened their shutters and the smell of fresh bread filled the air."
    }
  },
  {
    "id": "4",
    "word": "antics",
    "word_meaning": "funny or silly behavior",
    "difficulty_level": "easy",
    "passages": {
      "15": "The puppy's playful antics, like chasing its tail and pouncing on toys, made everyone burst out laughing.",
      "30": "During the family gathering, the puppy’s antics took center stage as it stole a sock, raced under the table, and peeked out with wide eyes, making everyone forget the serious conversation."
    }
  },
  {
    "id": "5",
    "word": "stern",
    "word_meaning": "serious and unrelenting in attitude",
    "difficulty_level": "medium",
    "passages": {
      "15": "The teacher's stern expression silenced the class within seconds of entering the room.",
      "30": "Standing at the front, the teacher’s stern gaze swept across the room, and whispers died instantly, replaced by the uneasy shuffling of feet and the quiet rustle of opening notebooks."
    }
  },
  {
    "id": "6",
    "word": "witty",
    "word_meaning": "showing quick and inventive verbal humor",
    "difficulty_level": "medium",
    "passages": {
      "15": "Her witty remark during the meeting made even the most serious manager chuckle unexpectedly.",
      "30": "During the tense meeting, her witty remark about the endless coffee refills broke the silence, prompting surprised laughter and easing the tension that had been building for over an hour."
    }
  },
  {
    "id": "7",
    "word": "loom",
    "word_meaning": "to appear in a large, strange, or frightening form",
    "difficulty_level": "medium",
    "passages": {
      "15": "Dark clouds began to loom over the hills, warning of an approaching storm.",
      "30": "Dark clouds loomed over the hills, swallowing the evening light, and the smell of rain drifted in as the first cold gust swept through the otherwise quiet valley."
    }
  },
  {
    "id": "8",
    "word": "modest",
    "word_meaning": "humble or simple",
    "difficulty_level": "medium",
    "passages": {
      "15": "Despite his success, he remained modest and avoided drawing attention to himself.",
      "30": "Even after receiving international recognition, he lived in a modest home, declined lavish gifts, and preferred sharing tea with old friends rather than attending grand events."
    }
  },
  {
    "id": "9",
    "word": "vivid",
    "word_meaning": "producing strong, clear images in the mind",
    "difficulty_level": "easy",
    "passages": {
      "15": "Her vivid account of the journey made listeners imagine every detail clearly.",
      "30": "Her vivid account painted the bustling market, the colorful fabrics swaying in the wind, the aroma of spices in the air, and the cheerful calls of vendors competing for attention."
    }
  },
  {
    "id": "10",
    "word": "frantic",
    "word_meaning": "wild with fear or anxiety",
    "difficulty_level": "medium",
    "passages": {
      "15": "He made a frantic dash through the crowd, searching desperately for his missing child.",
      "30": "He pushed through the crowd in a frantic search, calling his child’s name, his voice breaking, until a familiar giggle from behind the food stall stopped him in his tracks."
    }
  },
  {
    "id": "12",
    "word": "reluctant",
    "word_meaning": "unwilling or hesitant",
    "difficulty_level": "easy",
    "passages": {
      "15": "She was reluctant to speak, fearing her words might offend her friend.",
      "30": "She stood at the doorway, reluctant to speak, her thoughts swirling with doubt, knowing that once the truth left her lips, their friendship might never be the same again."
    }
  },
  {
    "id": "13",
    "word": "elaborate",
    "word_meaning": "involving many details",
    "difficulty_level": "medium",
    "passages": {
      "15": "The chef prepared an elaborate meal, complete with five courses and intricate garnishes.",
      "30": "The chef prepared an elaborate meal for the guests, each course arriving like a work of art, with flavors that shifted from bold to delicate in perfect succession."
    }
  },
  {
    "id": "14",
    "word": "resilient",
    "word_meaning": "able to recover quickly from difficulties",
    "difficulty_level": "medium",
    "passages": {
      "15": "Despite the setback, she remained resilient and worked hard to rebuild her business.",
      "30": "After losing everything in the flood, she stayed resilient, rebuilding her business from scratch, refusing to let disaster define the rest of her life."
    }
  },
  {
    "id": "15",
    "word": "ominous",
    "word_meaning": "giving the impression something bad is about to happen",
    "difficulty_level": "medium",
    "passages": {
      "15": "An ominous silence filled the forest, making the hikers uneasy and alert.",
      "30": "The forest grew silent, an ominous stillness replacing the chirping of birds, as if nature itself held its breath before something terrible emerged from the shadows."
    }
  },
  {
    "id": "16",
    "word": "meticulous",
    "word_meaning": "showing great attention to detail",
    "difficulty_level": "medium",
    "passages": {
      "15": "He was meticulous in his work, checking every detail before submission.",
      "30": "He worked meticulously, reviewing each document line by line, ensuring that not a single number, comma, or detail could be questioned by even the strictest inspector."
    }
  },
  {
    "id": "17",
    "word": "ephemeral",
    "word_meaning": "lasting for a very short time",
    "difficulty_level": "hard",
    "passages": {
      "15": "Cherry blossoms are beautiful yet ephemeral, blooming briefly before falling with the wind.",
      "30": "Cherry blossoms, breathtaking yet ephemeral, painted the park in shades of pink for just a week before a sudden wind scattered the petals like delicate whispers of spring."
    }
  },
  {
    "id": "18",
    "word": "inscrutable",
    "word_meaning": "impossible to understand or interpret",
    "difficulty_level": "hard",
    "passages": {
      "15": "His inscrutable expression left everyone wondering whether he approved of the plan.",
      "30": "He sat silently, his inscrutable gaze fixed on the speaker, revealing nothing—approval, disapproval, or amusement—leaving the room unsure of where his loyalty truly lay."
    }
  },
  {
    "id": "19",
    "word": "magnanimous",
    "word_meaning": "generous or forgiving, especially toward a rival",
    "difficulty_level": "hard",
    "passages": {
      "15": "In victory, she was magnanimous, offering kind words to her defeated opponent.",
      "30": "After winning the heated debate, she remained magnanimous, praising her rival’s arguments, and even offering to collaborate on the very reforms they had once fiercely disagreed about."
    }
  },
  {
    "id": "20",
    "word": "abstruse",
    "word_meaning": "difficult to understand",
    "difficulty_level": "hard",
    "passages": {
      "15": "The professor’s lecture was so abstruse that most students left feeling confused.",
      "30": "The professor’s lecture on quantum mechanics was painfully abstruse, filled with dense theories and abstract formulas that left even the brightest students questioning their grasp of reality."
    }
  },
  {
    "id": "21",
    "word": "luminous",
    "word_meaning": "bright or radiant, especially in a way that seems to glow",
    "difficulty_level": "medium",
    "passages": {
      "15": "The luminous moon cast a soft glow, illuminating the path through the dark forest.",
      "30": "Under the luminous moon, the forest trail glowed faintly, guiding their steps as the trees whispered secrets and fireflies flickered like tiny stars in the warm night air."
    }
  },
  {
    "id": "22",
    "word": "melancholy",
    "word_meaning": "a feeling of pensive sadness, often with no obvious cause",
    "difficulty_level": "medium",
    "passages": {
      "15": "A melancholy tune filled the room, making everyone pause and reflect quietly.",
      "30": "The violin played a melancholy tune, its notes lingering in the quiet room, stirring memories of forgotten summers and unspoken dreams among those who listened in silence."
    }
  },
  {
    "id": "23",
    "word": "furtive",
    "word_meaning": "attempting to avoid notice or attention, typically because of guilt",
    "difficulty_level": "hard",
    "passages": {
      "15": "His furtive glance at the locked drawer suggested he was hiding something important.",
      "30": "With a furtive glance at the locked drawer, he slipped the key into his pocket, hoping no one noticed his trembling hands or the nervous sweat on his brow."
    }
  },
  {
    "id": "24",
    "word": "exuberant",
    "word_meaning": "filled with lively energy and excitement",
    "difficulty_level": "medium",
    "passages": {
      "15": "Her exuberant laughter echoed through the park, drawing smiles from everyone nearby.",
      "30": "Her exuberant laughter rang out, bouncing across the park as she spun in circles, her joy infectious, pulling strangers into her orbit of unrestrained delight and warmth."
    }
  },
  {
    "id": "26",
    "word": "radiant",
    "word_meaning": "emitting light or heat; shining brightly",
    "difficulty_level": "medium",
    "passages": {
      "15": "Her radiant smile lit up the dull room, lifting everyone’s spirits instantly.",
      "30": "The festival was aglow with radiant lanterns, their golden light dancing on the river, casting warm reflections as children laughed and chased fireflies through the vibrant night."
    }
  },
  {
    "id": "27",
    "word": "somber",
    "word_meaning": "dark or dull in color or tone; gloomy",
    "difficulty_level": "medium",
    "passages": {
      "15": "The somber mood at the memorial silenced even the most talkative guests.",
      "30": "In the old church, a somber hymn echoed through stained-glass shadows, as mourners sat quietly, their thoughts heavy with memories of a life that had faded too soon."
    }
  },
  {
    "id": "28",
    "word": "clandestine",
    "word_meaning": "done secretly or kept hidden, especially because illicit",
    "difficulty_level": "hard",
    "passages": {
      "15": "Their clandestine meeting in the alley was hidden from prying eyes.",
      "30": "Under the cover of night, they held a clandestine gathering in the abandoned warehouse, whispering plans for the uprising as the distant city lights flickered unknowingly."
    }
  },
  {
    "id": "29",
    "word": "vivacious",
    "word_meaning": "attractively lively and animated",
    "difficulty_level": "medium",
    "passages": {
      "15": "Her vivacious energy made the party unforgettable, keeping everyone dancing.",
      "30": "With a twirl of her colorful skirt, her vivacious spirit transformed the quiet gathering, coaxing shy guests onto the dancefloor as music pulsed through the starlit garden."
    }
  },
  {
    "id": "30",
    "word": "arcane",
    "word_meaning": "mysterious or secret; understood by few",
    "difficulty_level": "hard",
    "passages": {
      "15": "The arcane symbols in the book puzzled even the seasoned scholars.",
      "30": "Hidden in the library’s dusty tomes, arcane rituals were inscribed in faded ink, their cryptic patterns baffling scholars who sought to unravel secrets long buried by time."
    }
  },
  {
    "id": "31",
    "word": "tranquil",
    "word_meaning": "calm and peaceful, free from disturbance",
    "difficulty_level": "easy",
    "passages": {
      "15": "The tranquil meadow was silent except for the gentle hum of buzzing bees.",
      "30": "In the tranquil valley, golden sunlight bathed rolling hills, where wildflowers swayed softly, and the only sound was a distant stream winding through the untouched landscape."
    }
  },
  {
    "id": "32",
    "word": "bleak",
    "word_meaning": "cold, bare, and unwelcoming; lacking hope",
    "difficulty_level": "medium",
    "passages": {
      "15": "The bleak winter landscape stretched endlessly, with bare trees under a gray sky.",
      "30": "Across the bleak moor, icy winds howled, stripping trees bare, as travelers huddled against the relentless cold, their hope dimming with each step through the desolate expanse."
    }
  },
  {
    "id": "33",
    "word": "candid",
    "word_meaning": "truthful and straightforward; frank",
    "difficulty_level": "medium",
    "passages": {
      "15": "Her candid feedback surprised the team but improved the project significantly.",
      "30": "During the heated discussion, her candid opinion cut through the noise, revealing flaws in the plan and prompting the team to rethink their approach with newfound clarity."
    }
  },
  {
    "id": "34",
    "word": "jovial",
    "word_meaning": "cheerful and friendly",
    "difficulty_level": "medium",
    "passages": {
      "15": "His jovial greeting warmed the room, making strangers feel like old friends.",
      "30": "With a jovial laugh, he welcomed guests to the tavern, sharing stories and pouring ale, turning a rainy evening into a cozy gathering of newfound companions."
    }
  },
  {
    "id": "35",
    "word": "cryptic",
    "word_meaning": "having a secret or hidden meaning; puzzling",
    "difficulty_level": "hard",
    "passages": {
      "15": "The cryptic note left on the desk baffled everyone in the office.",
      "30": "Found in an old trunk, the cryptic message, scrawled in faded ink, hinted at a hidden treasure, leaving the explorers puzzled and eager to decode its secrets."
    }
  },
  {
    "id": "36",
    "word": "placid",
    "word_meaning": "calm and not easily upset or excited",
    "difficulty_level": "easy",
    "passages": {
      "15": "The placid lake mirrored the sky, undisturbed by even a single ripple.",
      "30": "Nestled between mountains, the placid lake reflected drifting clouds, its stillness so profound that even the softest breeze failed to stir its glassy, serene surface."
    }
  },
  {
    "id": "38",
    "word": "pensive",
    "word_meaning": "engaged in deep or serious thought",
    "difficulty_level": "medium",
    "passages": {
      "15": "He sat pensive by the window, lost in thoughts of his past.",
      "30": "In the quiet café, he sat pensive, staring at the rain-streaked window, his coffee untouched, as memories of distant summers and lost chances swirled in his mind."
    }
  },
  {
    "id": "39",
    "word": "formidable",
    "word_meaning": "inspiring fear or respect through strength or size",
    "difficulty_level": "hard",
    "passages": {
      "15": "The formidable fortress loomed over the valley, its walls unbreached for centuries.",
      "30": "High above the valley, the formidable fortress stood, its ancient stones weathered but unyielding, guarding secrets of forgotten kings against invaders who dared approach its towering gates."
    }
  },
  {
    "id": "40",
    "word": "sprightly",
    "word_meaning": "lively and full of energy, especially in an older person",
    "difficulty_level": "medium",
    "passages": {
      "15": "The sprightly grandmother danced at the wedding, outshining the younger guests.",
      "30": "At the village fair, the sprightly grandmother twirled to the music, her laughter ringing, outpacing younger dancers and charming everyone with her boundless energy and radiant joy."
    }
  },
  {
    "id": "41",
    "word": "serendipity",
    "word_meaning": "finding something valuable or delightful by happy chance",
    "difficulty_level": "medium",
    "passages": {
      "15": "Their serendipity led to a rare book discovery in the dusty shop.",
      "30": "By sheer serendipity, she stumbled upon a charming café in the alley, where a chance meeting with an old friend sparked a conversation that changed her life’s direction."
    }
  },
  {
    "id": "42",
    "word": "forlorn",
    "word_meaning": "pitifully sad and abandoned or lonely",
    "difficulty_level": "medium",
    "passages": {
      "15": "The forlorn puppy waited by the gate, hoping for its owner’s return.",
      "30": "In the rain-soaked park, the forlorn puppy huddled by the rusted gate, its whimpers barely audible, waiting for an owner who had left it behind days ago."
    }
  },
  {
    "id": "43",
    "word": "intrepid",
    "word_meaning": "fearless and adventurous, often in difficult situations",
    "difficulty_level": "hard",
    "passages": {
      "15": "The intrepid explorer ventured into the uncharted jungle, undeterred by danger.",
      "30": "With an intrepid spirit, she trekked through the dense jungle, her machete clearing vines, unfazed by the distant roars and the unknown perils lurking beyond the next ridge"
    }
  },
  {
    "id": "44",
    "word": "languid",
    "word_meaning": "pleasantly lazy or relaxed; lacking energy",
    "difficulty_level": "medium",
    "passages": {
      "15": "She spent a languid afternoon lounging under the shade of an oak.",
      "30": "On the languid summer day, she reclined beneath the ancient oak, sipping lemonade, as the breeze carried the scent of wildflowers and time seemed to pause entirely"
    }
  },
  {
    "id": "45",
    "word": "obscure",
    "word_meaning": "not well-known; hidden or uncertain",
    "difficulty_level": "hard",
    "passages": {
      "15": "The obscure poet’s work was cherished by a small, devoted group.",
      "30": "Tucked in a forgotten archive, the obscure poet’s verses, rich with metaphor, captivated the lone scholar who unearthed them, revealing truths lost to the wider world"
    }
  },
  {
    "id": "46",
    "word": "ebullient",
    "word_meaning": "overflowing with enthusiasm or excitement",
    "difficulty_level": "medium",
    "passages": {
      "15": "His ebullient cheers rallied the team during the final moments of the game.",
      "30": "With ebullient energy, he led the crowd in a chant, his voice booming across the stadium, igniting a surge of excitement that carried the team to victory"
    }
  },
  {
    "id": "47",
    "word": "austere",
    "word_meaning": "plain and without decoration; strict or severe",
    "difficulty_level": "hard",
    "passages": {
      "15": "The austere room had only a table and a single wooden chair.",
      "30": "The monk’s austere cell, bare except for a straw mat and a worn book, reflected his vow of simplicity, a stark contrast to the opulent world outside"
    }
  },
  {
    "id": "48",
    "word": "whimsical",
    "word_meaning": "playfully quaint or fanciful, often in an appealing way",
    "difficulty_level": "medium",
    "passages": {
      "15": "The whimsical mural of dancing animals brightened the children’s hospital ward.",
      "30": "In the garden, a whimsical statue of a grinning fox, adorned with flowers, delighted visitors, who imagined it winking as they strolled through the blooming pathways"
    }
  },
  {
    "id": "49",
    "word": "tenacious",
    "word_meaning": "holding fast; persistent in achieving a goal",
    "difficulty_level": "medium",
    "passages": {
      "15": "Her tenacious effort secured the deal despite numerous setbacks and doubts.",
      "30": "With tenacious resolve, she negotiated tirelessly, overcoming every obstacle, until the contract was signed, proving her skeptics wrong in a boardroom buzzing with newfound respect"
    }
  },
  {
    "id": "50",
    "word": "esoteric",
    "word_meaning": "intended for or understood by only a small group",
    "difficulty_level": "hard",
    "passages": {
      "15": "His esoteric lecture on ancient runes confused most of the audience.",
      "30": "Delivering an esoteric discourse on forgotten alchemical symbols, he captivated a handful of enthusiasts, while others in the lecture hall exchanged puzzled glances, lost in his arcane references"
    }
  },
  {
    "id": "51",
    "word": "buoyant",
    "word_meaning": "cheerful or resilient; able to float",
    "difficulty_level": "medium",
    "passages": {
      "15": "After setbacks, her spirit remained buoyant, inspiring others with her optimism.",
      "30": "Despite the challenges of the long journey, she stayed cheerful, her buoyant attitude lifting the weary group as they crossed the final hill to see the sparkling sea."
    }
  },
  {
    "id": "52",
    "word": "dreary",
    "word_meaning": "dull, bleak, and depressing",
    "difficulty_level": "medium",
    "passages": {
      "15": "The endless rain made the small town feel dreary and lifeless.",
      "30": "For weeks, the rain-soaked village, with its gray streets and shuttered windows, became dreary, as if the sun had forgotten to return, leaving only a heavy silence."
    }
  },
  {
    "id": "53",
    "word": "subtle",
    "word_meaning": "delicate or precise, often difficult to notice",
    "difficulty_level": "medium",
    "passages": {
      "15": "His compliment was so subtle that only she caught its meaning.",
      "30": "While others missed it, her keen ear detected the subtle hint in his quiet words, a fleeting warmth beneath his usual reserve that revealed his true affection."
    }
  },
  {
    "id": "54",
    "word": "gallant",
    "word_meaning": "brave or heroic, often with chivalrous courtesy",
    "difficulty_level": "hard",
    "passages": {
      "15": "He made a gallant effort to save the child from danger.",
      "30": "With no regard for his own safety, he acted in a gallant manner, rushing through the flames to carry the frightened child to safety before the building collapsed."
    }
  },
  {
    "id": "55",
    "word": "quaint",
    "word_meaning": "attractively old-fashioned or unusual",
    "difficulty_level": "medium",
    "passages": {
      "15": "The village had a quaint charm with its cobblestone streets and tiny shops.",
      "30": "Wandering through the village, she admired its quaint appeal, from ivy-covered cottages to the small bakery where the scent of fresh bread mingled with blooming roses."
    }
  },
  {
    "id": "56",
    "word": "zealous",
    "word_meaning": "having or showing great enthusiasm or devotion",
    "difficulty_level": "medium",
    "passages": {
      "15": "Her zealous dedication to the cause inspired the entire volunteer team.",
      "30": "Leading the campaign, she worked tirelessly, her zealous commitment rallying volunteers who stayed late, fueled by her passion to bring clean water to the remote village."
    }
  },
  {
    "id": "57",
    "word": "nebulous",
    "word_meaning": "vague or unclear; lacking definite form",
    "difficulty_level": "hard",
    "passages": {
      "15": "His explanation of the theory was too nebulous to follow.",
      "30": "Trying to grasp his theory, the students found his ideas nebulous, a haze of abstract terms that drifted without anchor, leaving them confused yet intrigued."
    }
  },
  {
    "id": "58",
    "word": "blithe",
    "word_meaning": "carefree and cheerful, often heedless of consequences",
    "difficulty_level": "medium",
    "passages": {
      "15": "She skipped through the market with a blithe disregard for the crowd.",
      "30": "Dancing through the bustling market, she moved with blithe ease, ignoring the chaos, her carefree laughter rising above the vendors’ calls and the hum of busy shoppers."
    }
  },
  {
    "id": "59",
    "word": "profound",
    "word_meaning": "deep or intense; showing great insight",
    "difficulty_level": "hard",
    "passages": {
      "15": "Her speech left a profound impact on the quiet audience.",
      "30": "As she spoke of hope and loss, her words carried a profound weight, stirring the audience to silence, each listener reflecting on their own unspoken dreams."
    }
  },
  {
    "id": "60",
    "word": "spry",
    "word_meaning": "active and lively, especially in an older person",
    "difficulty_level": "medium",
    "passages": {
      "15": "The old gardener was spry, tending roses with youthful energy.",
      "30": "Despite his age, the gardener moved with spry agility, pruning roses and hauling soil, his hands steady and his whistle cheerful under the warm afternoon sun."
    }
  },
  {
    "id": "61",
    "word": "effervescent",
    "word_meaning": "lively and enthusiastic; bubbling with energy",
    "difficulty_level": "medium",
    "passages": {
      "15": "Her laughter filled the room, effervescent and contagious, sparking joy in all.",
      "30": "At the festival, her effervescent spirit shone, as she danced through crowds, her laughter bubbling like champagne, drawing smiles from strangers under the twinkling evening lights."
    }
  },
  {
    "id": "62",
    "word": "lugubrious",
    "word_meaning": "mournful or gloomy, especially exaggeratedly so",
    "difficulty_level": "hard",
    "passages": {
      "15": "His lugubrious tone at the meeting dampened everyone’s enthusiasm.",
      "30": "Speaking in a lugubrious voice, he recounted the town’s hardships, his exaggerated sighs casting a heavy gloom over the gathering, despite the bright morning outside."
    }
  },
  {
    "id": "63",
    "word": "prudent",
    "word_meaning": "acting with or showing care for the future",
    "difficulty_level": "medium",
    "passages": {
      "15": "She saved money each month, prudent in planning for unexpected expenses.",
      "30": "With careful foresight, she made prudent choices, setting aside funds each month, ensuring her family’s stability even as others spent recklessly in the prosperous village."
    }
  },
  {
    "id": "64",
    "word": "capricious",
    "word_meaning": "given to sudden or unpredictable changes of mood or behavior",
    "difficulty_level": "hard",
    "passages": {
      "15": "The weather was capricious, shifting from sunny to stormy in minutes.",
      "30": "Travelers cursed the capricious skies, as morning sun gave way to sudden torrents, soaking their gear and forcing them to seek shelter in the unpredictable mountain pass."
    }
  },
  {
    "id": "65",
    "word": "rustic",
    "word_meaning": "simple and charmingly rural or unsophisticated",
    "difficulty_level": "medium",
    "passages": {
      "15": "The cabin had a rustic appeal, with wooden walls and a stone hearth.",
      "30": "Nestled in the hills, the rustic farmhouse, with its creaking floors and hand-carved beams, welcomed visitors with a cozy warmth that city life could never match."
    }
  },
  {
    "id": "66",
    "word": "fervent",
    "word_meaning": "having or showing intense passion or enthusiasm",
    "difficulty_level": "medium",
    "passages": {
      "15": "His fervent speech rallied the crowd to support the new initiative.",
      "30": "Standing tall, he delivered a fervent plea for change, his voice trembling with passion, igniting the crowd’s resolve to rebuild their community stronger than ever before."
    }
  },
  {
    "id": "67",
    "word": "obtuse",
    "word_meaning": "slow to understand; lacking sharpness or quickness",
    "difficulty_level": "hard",
    "passages": {
      "15": "His obtuse response to the question frustrated the entire study group.",
      "30": "When asked about the complex problem, his obtuse reply, missing the point entirely, left the team exasperated, forcing them to explain the basics yet again."
    }
  },
  {
    "id": "68",
    "word": "jaunty",
    "word_meaning": "lively and confident in manner or appearance",
    "difficulty_level": "medium",
    "passages": {
      "15": "He strolled through the park, his hat tilted in a jaunty angle.",
      "30": "With a whistle and a jaunty stride, he crossed the vibrant park, his bright scarf fluttering, turning heads as he tipped his hat to amused passersby."
    }
  },
  {
    "id": "69",
    "word": "poignant",
    "word_meaning": "evoking a keen sense of sadness or regret",
    "difficulty_level": "hard",
    "passages": {
      "15": "The old photo stirred poignant memories of her childhood summers.",
      "30": "Holding the faded photo, she felt a poignant ache, as memories of carefree summers with her siblings flooded back, now distant in the quiet of her empty house."
    }
  },
  {
    "id": "70",
    "word": "vibrant",
    "word_meaning": "full of energy and life; bright and striking",
    "difficulty_level": "medium",
    "passages": {
      "15": "The market was alive with vibrant colors and bustling energy.",
      "30": "As dawn broke, the market buzzed with vibrant stalls, where merchants shouted over piles of crimson apples and golden fabrics, drawing crowds to the lively scene."
    }
  },
  {
    "id": "71",
    "word": "exultant",
    "word_meaning": "triumphantly happy or jubilant",
    "difficulty_level": "medium",
    "passages": {
      "15": "The team was exultant, cheering wildly after their unexpected victory.",
      "30": "After the final whistle, the underdog team erupted in exultant joy, hugging and shouting, as fans stormed the field, swept up in the thrill of their improbable triumph."
    }
  },
  {
    "id": "72",
    "word": "sullen",
    "word_meaning": "bad-tempered or gloomy; silently resentful",
    "difficulty_level": "medium",
    "passages": {
      "15": "He sat in sullen silence, ignoring the cheerful chatter around him.",
      "30": "Refusing to join the lively picnic, he brooded in sullen quiet, his scowl deepening as laughter echoed across the sunny meadow, untouched by his private grievances."
    }
  },
  {
    "id": "73",
    "word": "astute",
    "word_meaning": "having or showing keen perception or insight",
    "difficulty_level": "hard",
    "passages": {
      "15": "Her astute analysis of the market trends impressed the investors.",
      "30": "During the tense negotiations, she offered an astute observation, spotting a hidden flaw in the contract that saved her company from a costly oversight."
    }
  },
  {
    "id": "74",
    "word": "mercurial",
    "word_meaning": "subject to sudden or unpredictable changes of mood",
    "difficulty_level": "hard",
    "passages": {
      "15": "His mercurial nature made him charming one moment, irritable the next.",
      "30": "Colleagues never knew what to expect from his mercurial temperament, as he swung from jovial laughter at lunch to sharp criticism in the afternoon meeting."
    }
  },
  {
    "id": "75",
    "word": "idyllic",
    "word_meaning": "charmingly simple or peaceful, like a perfect scene",
    "difficulty_level": "medium",
    "passages": {
      "15": "The seaside village offered an idyllic escape from city life.",
      "30": "Nestled by the azure waves, the village was an idyllic haven, with whitewashed cottages and fishing boats bobbing gently under a sky painted with soft pinks."
    }
  },
  {
    "id": "76",
    "word": "ardent",
    "word_meaning": "passionate or intensely enthusiastic",
    "difficulty_level": "medium",
    "passages": {
      "15": "She was an ardent supporter of the local animal shelter’s mission.",
      "30": "Volunteering tirelessly, her ardent devotion to the shelter inspired others, as she spent weekends cleaning kennels and fundraising to save every stray in the community."
    }
  },
  {
    "id": "77",
    "word": "enigmatic",
    "word_meaning": "mysterious and difficult to interpret or understand",
    "difficulty_level": "hard",
    "passages": {
      "15": "The painting’s enigmatic symbols puzzled art critics for decades.",
      "30": "In the dim gallery, the canvas held enigmatic shapes, their meanings elusive, drawing whispers from critics who debated its secrets under the flickering candlelight."
    }
  },
  {
    "id": "79",
    "word": "taciturn",
    "word_meaning": "reserved or uncommunicative in speech; saying little",
    "difficulty_level": "hard",
    "passages": {
      "15": "The taciturn farmer only nodded, rarely speaking to his neighbors.",
      "30": "Known for his taciturn ways, the farmer worked his fields in silence, offering only a nod to passersby, his thoughts hidden behind a weathered face and steady hands."
    }
  },
  {
    "id": "80",
    "word": "lissome",
    "word_meaning": "gracefully slender and flexible; moving with ease",
    "difficulty_level": "medium",
    "passages": {
      "15": "The dancer moved with lissome grace across the polished stage.",
      "30": "On the moonlit stage, her lissome movements captivated the audience, each step flowing effortlessly, like a willow bending in the breeze, weaving a spell of elegance."
    }
  },
  {
    "id": "81",
    "word": "elated",
    "word_meaning": "extremely happy and excited",
    "difficulty_level": "medium",
    "passages": {
      "15": "The team felt elated after their project won first place at the fair.",
      "30": "When the judges announced their win, the team was elated, cheering wildly, their hard work rewarded as they danced around the stage under bright festival lights."
    }
  },
  {
    "id": "82",
    "word": "gloomy",
    "word_meaning": "dark or poorly lit; depressing or sad",
    "difficulty_level": "medium",
    "passages": {
      "15": "The forest path grew gloomy, shrouded in mist and heavy shadows.",
      "30": "As twilight fell, the forest turned gloomy, its dense canopy blocking moonlight, with only faint rustles breaking the oppressive silence that weighed on the travelers’ hearts."
    }
  },
  {
    "id": "83",
    "word": "cunning",
    "word_meaning": "having skill in achieving goals by deceit or evasion",
    "difficulty_level": "easy",
    "passages": {
      "15": "The fox used cunning tricks to escape the hunter’s trap.",
      "30": "Slipping through the underbrush, the fox employed cunning tactics, outwitting the hunter by doubling back and vanishing into the thicket before the trap could snap shut."
    }
  },
  {
    "id": "84",
    "word": "fickle",
    "word_meaning": "changing frequently, especially in loyalties or affections",
    "difficulty_level": "medium",
    "passages": {
      "15": "Her fickle tastes in fashion baffled her friends every season.",
      "30": "Each month, her wardrobe reflected fickle whims, switching from bold patterns to minimalist styles, leaving friends puzzled as they tried to keep up with her ever-changing preferences."
    }
  },
  {
    "id": "85",
    "word": "bucolic",
    "word_meaning": "relating to the pleasant aspects of rural life",
    "difficulty_level": "medium",
    "passages": {
      "15": "The farm’s bucolic charm drew visitors seeking peace and simplicity.",
      "30": "Surrounded by rolling fields, the farm exuded bucolic tranquility, with cows grazing lazily and wildflowers swaying, offering city dwellers a serene escape from urban chaos."
    }
  },
  {
    "id": "86",
    "word": "impassioned",
    "word_meaning": "filled with intense feeling or passion",
    "difficulty_level": "hard",
    "passages": {
      "15": "Her speech was so impassioned it moved the audience to tears.",
      "30": "Addressing the rally, her impassioned words about justice rang out, stirring hearts and sparking tears among listeners who felt the weight of her unwavering conviction."
    }
  },
  {
    "id": "87",
    "word": "elusive",
    "word_meaning": "difficult to find, catch, or achieve",
    "difficulty_level": "medium",
    "passages": {
      "15": "The rare bird proved elusive, vanishing before photographers could capture it.",
      "30": "Deep in the jungle, the rare bird remained elusive, its vibrant feathers glimpsed only briefly before it darted into the canopy, leaving researchers empty-handed yet determined."
    }
  },
  {
    "id": "88",
    "word": "genial",
    "word_meaning": "friendly and cheerful in manner",
    "difficulty_level": "medium",
    "passages": {
      "15": "The shopkeeper’s genial smile welcomed customers to his cozy store.",
      "30": "With a genial nod, the shopkeeper greeted each patron, his warm chatter and bright smile turning the small bookstore into a haven for curious readers."
    }
  },
  {
    "id": "89",
    "word": "rueful",
    "word_meaning": "expressing sorrow or regret, often with a hint of humor",
    "difficulty_level": "medium",
    "passages": {
      "15": "He gave a rueful grin, admitting his mistake in the game.",
      "30": "Shaking his head with a rueful chuckle, he confessed to misjudging the chess move, his playful regret easing the tension as opponents laughed around the board."
    }
  },
  {
    "id": "90",
    "word": "agile",
    "word_meaning": "able to move quickly and easily",
    "difficulty_level": "easy",
    "passages": {
      "15": "The cat was agile, leaping from branch to branch with ease.",
      "30": "Perched on the fence, the cat moved with agile grace, bounding across tree branches, its swift leaps dodging leaves as it chased a fluttering moth in moonlight."
    }
  },
  {
    "id": "91",
    "word": "gleeful",
    "word_meaning": "exuberantly or joyfully happy",
    "difficulty_level": "medium",
    "passages": {
      "15": "The children were gleeful, chasing balloons across the sunny park.",
      "30": "In the vibrant park, children ran with gleeful shouts, their laughter echoing as they chased bright red balloons floating high above the emerald grass and blooming flowers."
    }
  },
  {
    "id": "92",
    "word": "dour",
    "word_meaning": "relentlessly severe or stern in manner",
    "difficulty_level": "hard",
    "passages": {
      "15": "His dour expression silenced the room during the heated debate.",
      "30": "The council meeting grew tense as his dour presence, marked by a stern glare and clipped words, cast a chill over the room, halting the lively discussion."
    }
  },
  {
    "id": "93",
    "word": "wily",
    "word_meaning": "skilled at gaining an advantage through cleverness",
    "difficulty_level": "medium",
    "passages": {
      "15": "The merchant used wily tactics to secure the best deal.",
      "30": "Negotiating in the crowded bazaar, the merchant’s wily strategies outsmarted competitors, securing a rare deal on spices before anyone else noticed the opportunity."
    }
  },
  {
    "id": "94",
    "word": "volatile",
    "word_meaning": "likely to change rapidly and unpredictably",
    "difficulty_level": "easy",
    "passages": {
      "15": "The stock market was volatile, shifting wildly from day to day.",
      "30": "Traders watched in dismay as the market turned volatile, prices soaring then crashing unexpectedly, leaving even seasoned investors scrambling to predict the next sudden shift."
    }
  },
  {
    "id": "95",
    "word": "serene",
    "word_meaning": "calm, peaceful, and untroubled",
    "difficulty_level": "easy",
    "passages": {
      "15": "The garden was serene, filled with the soft hum of bees.",
      "30": "Bathed in morning light, the garden remained serene, its quiet beauty unfolding as butterflies danced among roses and a gentle breeze carried the scent of lavender."
    }
  },
  {
    "id": "97",
    "word": "recondite",
    "word_meaning": "little known; abstruse or obscure",
    "difficulty_level": "hard",
    "passages": {
      "15": "The scholar’s recondite theories baffled even his academic peers.",
      "30": "In the quiet library, his recondite research on ancient dialects, filled with obscure references, left colleagues puzzled, as only a few could grasp its intricate depth."
    }
  },
  {
    "id": "100",
    "word": "deft",
    "word_meaning": "neatly skillful and quick in movement",
    "difficulty_level": "medium",
    "passages": {
      "15": "The chef’s deft hands sliced vegetables with astonishing precision.",
      "30": "In the bustling kitchen, the chef worked with deft precision, her knife flashing as she carved delicate patterns into vegetables, impressing the crowd at the cooking demonstration."
    }
  },
  {
    "id": "101",
    "word": "ecstatic",
    "word_meaning": "feeling or expressing overwhelming happiness or joy",
    "difficulty_level": "medium",
    "passages": {
      "15": "The fans were ecstatic, screaming as their team scored the winning goal.",
      "30": "When the final whistle blew, the stadium roared with ecstatic fans, their cheers echoing as they waved banners, celebrating the team’s thrilling victory under dazzling floodlights."
    }
  },
  {
    "id": "102",
    "word": "brooding",
    "word_meaning": "showing deep unhappiness or thoughtfulness",
    "difficulty_level": "medium",
    "passages": {
      "15": "He sat by the river, brooding over his recent failures.",
      "30": "Alone by the rushing river, his brooding silence spoke of regrets, as he stared at the water, lost in thoughts of missed opportunities under a darkening sky."
    }
  },
  {
    "id": "103",
    "word": "sagacious",
    "word_meaning": "having or showing keen mental discernment and good judgment",
    "difficulty_level": "hard",
    "passages": {
      "15": "Her sagacious advice guided the committee through the complex decision.",
      "30": "Faced with a crisis, the council relied on her sagacious insight, her calm judgment untangling the problem, steering them toward a solution no one else foresaw."
    }
  },
  {
    "id": "104",
    "word": "impulsive",
    "word_meaning": "acting or done without forethought",
    "difficulty_level": "medium",
    "passages": {
      "15": "His impulsive decision to book a trip surprised his cautious friends.",
      "30": "Without a plan, he made an impulsive choice to board a train to the coast, leaving friends stunned as he chased adventure under a spontaneous summer whim."
    }
  },
  {
    "id": "105",
    "word": "verdant",
    "word_meaning": "green with vegetation; lush and thriving",
    "difficulty_level": "medium",
    "passages": {
      "15": "The valley was verdant, bursting with lush meadows and wildflowers.",
      "30": "Stretching before the hikers, the verdant valley bloomed with emerald grasses and vibrant blooms, a living tapestry framed by mountains under a clear, endless sky."
    }
  },
  {
    "id": "106",
    "word": "fervid",
    "word_meaning": "intensely enthusiastic or passionate",
    "difficulty_level": "hard",
    "passages": {
      "15": "His fervid defense of the cause inspired the entire audience.",
      "30": "With a fervid speech, he rallied the crowd, his passionate voice shaking with conviction, urging them to join the movement for change under a blazing sunset."
    }
  },
  {
    "id": "107",
    "word": "abstruse",
    "word_meaning": "difficult to understand; obscure",
    "difficulty_level": "hard",
    "passages": {
      "15": "The philosopher’s abstruse arguments left the students utterly perplexed.",
      "30": "In the lecture hall, his abstruse theories on metaphysics, dense with jargon, baffled students, who scribbled notes in vain, trying to grasp the obscure concepts."
    }
  },
  {
    "id": "108",
    "word": "jocund",
    "word_meaning": "cheerful and lighthearted",
    "difficulty_level": "hard",
    "passages": {
      "15": "Her jocund laughter filled the picnic, easing everyone’s worries.",
      "30": "Amid the sunny meadow, her jocund spirit shone, her playful banter and bright laughter lifting the picnic’s mood as friends forgot their cares and joined in."
    }
  },
  {
    "id": "109",
    "word": "mournful",
    "word_meaning": "expressing sorrow or grief; sad",
    "difficulty_level": "medium",
    "passages": {
      "15": "The violin’s mournful notes echoed through the empty chapel.",
      "30": "In the deserted chapel, the violin played a weepy, mournful melody, its haunting notes filling the air, evoking memories of loss for the lone listener inside."
    }
  },
  {
    "id": "110",
    "word": "lithe",
    "word_meaning": "thin, supple, and graceful in movement",
    "difficulty_level": "medium",
    "passages": {
      "15": "The gymnast moved with lithe elegance, captivating the audience.",
      "30": "On the arena floor, the gymnast’s lithe form twisted gracefully, each fluid motion drawing gasps from the crowd, who watched her defy gravity with effortless poise."
    }
  },
  {
    "id": "111",
    "word": "blissful",
    "word_meaning": "extremely happy and peaceful",
    "difficulty_level": "medium",
    "passages": {
      "15": "The couple enjoyed a blissful evening watching stars by the lake.",
      "30": "Under a velvet sky, their blissful picnic by the lake felt timeless, as they shared blissful moments, laughing softly while fireflies danced around their cozy blanket."
    }
  },
  {
    "id": "112",
    "word": "sardonic",
    "word_meaning": "grimly mocking or cynical",
    "difficulty_level": "hard",
    "passages": {
      "15": "His sardonic remark about the plan drew uneasy laughs from the team.",
      "30": "With a sardonic smirk, he critiqued the flawed proposal, his sharp words laced with sardonic humor, making colleagues shift uncomfortably while secretly agreeing with his biting wit."
    }
  },
  {
    "id": "113",
    "word": "clever",
    "word_meaning": "quick to understand, learn, or devise solutions",
    "difficulty_level": "easy",
    "passages": {
      "15": "Her clever solution fixed the machine in minutes, surprising everyone.",
      "30": "Faced with a broken engine, she devised a fix, using spare parts, her clever ingenuity saving the day as the machine roared back to life."
    }
  },
  {
    "id": "114",
    "word": "wayward",
    "word_meaning": "difficult to control or predict; disobedient",
    "difficulty_level": "medium",
    "passages": {
      "15": "The wayward kite soared wildly, ignoring the child’s desperate tugs.",
      "30": "High above the festival, the wayward kite danced unpredictably, pulling against the string, its wayward path thrilling onlookers as it dipped and twirled in the gusty breeze."
    }
  },
  {
    "id": "115",
    "word": "pristine",
    "word_meaning": "clean, fresh, or unspoiled",
    "difficulty_level": "medium",
    "passages": {
      "15": "The pristine snow blanketed the valley, untouched by human footsteps.",
      "30": "After the storm, the valley lay under pristine snow, its flawless sparkle untouched, reflecting sunlight in a pristine glow that hushed the explorers in quiet awe."
    }
  },
  {
    "id": "116",
    "word": "zealous",
    "word_meaning": "having or showing great enthusiasm or devotion",
    "difficulty_level": "medium",
    "passages": {
      "15": "His zealous support for the project motivated the entire team.",
      "30": "With zealous energy, he championed the charity drive, his tireless efforts and zealous speeches inspiring volunteers to work harder, transforming the community with newfound hope."
    }
  },
  {
    "id": "117",
    "word": "arcane",
    "word_meaning": "mysterious or secret; understood by few",
    "difficulty_level": "hard",
    "passages": {
      "15": "The book’s arcane knowledge fascinated only a few dedicated scholars.",
      "30": "Hidden in the library, the tome held secrets, its arcane symbols deciphered only by a select few, who pored over its pages under flickering candlelight."
    }
  },
  {
    "id": "119",
    "word": "evocative",
    "word_meaning": "bringing strong images, memories, or feelings to mind",
    "difficulty_level": "hard",
    "passages": {
      "15": "The poem’s evocative imagery transported readers to a distant shore.",
      "30": "Her evocative verses painted a seaside village, their vivid words so evocative that readers felt the salty breeze and heard the waves crashing in their minds."
    }
  },
  {
    "id": "120",
    "word": "sprightly",
    "word_meaning": "lively and full of energy, especially in an older person",
    "difficulty_level": "medium",
    "passages": {
      "15": "The sprightly retiree led the dance with surprising energy.",
      "30": "At the community ball, the retiree’s sprightly twirls stole the show, her sprightly energy outshining younger dancers as she glided across the floor with infectious joy."
    }
  },
  {
    "id": "121",
    "word": "jocular",
    "word_meaning": "fond of or characterized by joking; humorous or playful",
    "difficulty_level": "medium",
    "passages": {
      "15": "His jocular banter at the party kept everyone laughing all night.",
      "30": "With jocular wit, he entertained guests, his playful jocular remarks about the host’s quirky hat sparking laughter as the room buzzed with warmth and good cheer."
    }
  },
  {
    "id": "122",
    "word": "forbidding",
    "word_meaning": "unfriendly or threatening in appearance",
    "difficulty_level": "medium",
    "passages": {
      "15": "The castle’s forbidding walls deterred even the bravest adventurers.",
      "30": "Looming over the misty valley, the castle’s forbidding gates, tall and iron-clad, cast a forbidding shadow, warning travelers to steer clear of its ancient, guarded secrets."
    }
  },
  {
    "id": "123",
    "word": "nimble",
    "word_meaning": "quick and light in movement or action",
    "difficulty_level": "medium",
    "passages": {
      "15": "Her nimble fingers wove the intricate pattern into the fabric.",
      "30": "With nimble hands, she crafted a delicate tapestry, her nimble fingers threading vibrant colors, creating a masterpiece that captivated everyone at the village fair."
    }
  },
  {
    "id": "124",
    "word": "erratic",
    "word_meaning": "unpredictable or inconsistent in movement or behavior",
    "difficulty_level": "medium",
    "passages": {
      "15": "The erratic flight of the butterfly confused the eager children.",
      "30": "Chasing the butterfly’s erratic path through the meadow, children giggled, its erratic zigzags eluding their nets, as it danced freely in the warm afternoon breeze."
    }
  },
  {
    "id": "125",
    "word": "pastoral",
    "word_meaning": "relating to the peaceful, simple life of the countryside",
    "difficulty_level": "medium",
    "passages": {
      "15": "The pastoral scene of grazing sheep calmed the weary travelers.",
      "30": "In the pastoral valley, sheep grazed lazily, their soft bleats blending with the pastoral breeze, offering travelers a moment of peace amidst rolling hills and wildflowers."
    }
  },
  {
    "id": "126",
    "word": "vehement",
    "word_meaning": "showing strong feeling; forceful or intense",
    "difficulty_level": "hard",
    "passages": {
      "15": "Her vehement protest against the decision shook the quiet meeting.",
      "30": "With a vehement cry, she opposed the unfair policy, her passion igniting the crowd, who rose in support, their cheers echoing through the town hall."
    }
  },
  {
    "id": "127",
    "word": "oblique",
    "word_meaning": "indirect or evasive; not straightforward",
    "difficulty_level": "hard",
    "passages": {
      "15": "His oblique reply to the question left everyone puzzled.",
      "30": "When pressed for details, his oblique response, veiled in vague hints, and his oblique smile only deepened the mystery, frustrating colleagues seeking clear answers."
    }
  },
  {
    "id": "128",
    "word": "cheerful",
    "word_meaning": "noticeably happy and optimistic",
    "difficulty_level": "easy",
    "passages": {
      "15": "Her cheerful greeting brightened the mood of the rainy morning.",
      "30": "Entering the café with a cheerful wave, she spread warmth, her bright smile lifting spirits as customers forgot the dreary rain pattering against the windows."
    }
  },
  {
    "id": "129",
    "word": "wistful",
    "word_meaning": "having or showing a feeling of vague or regretful longing",
    "difficulty_level": "medium",
    "passages": {
      "15": "She gazed with wistful eyes at her childhood home.",
      "30": "Standing before her old house, her wistful gaze lingered on faded shutters, memories of summers flooding back, now distant in the quiet autumn light."
    }
  },
  {
    "id": "130",
    "word": "debonair",
    "word_meaning": "confident, stylish, and charming",
    "difficulty_level": "medium",
    "passages": {
      "15": "His debonair charm captivated everyone at the elegant gala.",
      "30": "Strolling through the gala, his debonair style, from tailored suit to easy smile, and wit won over guests, who admired his effortless grace and charm."
    }
  },
  {
    "id": "132",
    "word": "stoic",
    "word_meaning": "enduring pain or hardship without showing emotion",
    "difficulty_level": "medium",
    "passages": {
      "15": "His stoic demeanor during the crisis calmed the panicked team.",
      "30": "Facing the storm’s destruction, his stoic resolve steadied the group, as he quietly organized supplies and led them to safety without a hint of fear."
    }
  },
  {
    "id": "133",
    "word": "vivid",
    "word_meaning": "producing strong, clear images in the mind",
    "difficulty_level": "easy",
    "passages": {
      "15": "Her vivid story of the adventure captivated the entire classroom.",
      "30": "She shared a vivid tale of climbing snowy peaks, painting scenes of icy cliffs and starlit skies that held her classmates spellbound in the quiet room."
    }
  },
  {
    "id": "134",
    "word": "querulous",
    "word_meaning": "complaining in a whining or petulant manner",
    "difficulty_level": "hard",
    "passages": {
      "15": "His querulous tone annoyed the shopkeeper, who ignored his complaints.",
      "30": "The customer’s querulous voice echoed through the store, grumbling about prices, testing the clerk’s patience as others exchanged glances in the crowded, bustling shop."
    }
  },
  {
    "id": "135",
    "word": "exuberant",
    "word_meaning": "filled with lively energy and excitement",
    "difficulty_level": "medium",
    "passages": {
      "15": "The puppy’s exuberant leaps made the children giggle with delight.",
      "30": "Chasing a ball, the puppy’s exuberant energy filled the park, its playful bounds and eager barks sparking joy among kids playing under the sunny sky."
    }
  },
  {
    "id": "136",
    "word": "ebullient",
    "word_meaning": "overflowing with enthusiasm or excitement",
    "difficulty_level": "medium",
    "passages": {
      "15": "Her ebullient cheers spirit, rallied the tired runners.",
      "30": "With ebullient shouts, her enthusiasm lifted the marathon runners, their weary steps quickening as she waved banners and cheered from the vibrant sidelines."
    }
  },
  {
    "id": "137",
    "word": "pungent",
    "word_meaning": "having a sharp, strong taste or smell",
    "difficulty_level": "medium",
    "passages": {
      "15": "The pungent aroma of spices filled the bustling kitchen.",
      "30": "In the market, pungent spices released a pungent scent, drawing cooks to stalls where vibrant powders promised bold flavors for dishes simmering in nearby homes."
    }
  },
  {
    "id": "138",
    "word": "resolute",
    "word_meaning": "determined and unwavering in purpose",
    "difficulty_level": "medium",
    "passages": {
      "15": "With resolute focus, she trained daily for the competition.",
      "30": "Her resolute determination shone as she trained, resolute in her goal, ignoring blisters and fatigue to perfect each move for the championship under the stadium lights."
    }
  },
  {
    "id": "140",
    "word": "serendipitous",
    "word_meaning": "occurring by fortunate chance in a delightful way",
    "difficulty_level": "medium",
    "passages": {
      "15": "A serendipitous find led her to a rare painting.",
      "30": "In the dusty shop, a discovery of a serendipitous artwork, hidden behind crates, thrilled her, its vibrant colors sparking joy and a sense of destiny."
    }
  },
  {
    "id": "141",
    "word": "charming",
    "word_meaning": "pleasantly attractive or delightful in manner",
    "difficulty_level": "easy",
    "passages": {
      "15": "You should’ve seen Tom’s charming smile; it won over the whole café!",
      "30": "So, Tom walks into the café with this charming grin, and honestly, everyone just melts; even the grumpy barista starts chatting with him like they’re old pals."
    }
  },
  {
    "id": "142",
    "word": "perplexing",
    "word_meaning": "completely baffling or puzzling",
    "difficulty_level": "medium",
    "passages": {
      "15": "That riddle was so perplexing, we gave up after an hour.",
      "30": "Okay, we sat around the campfire trying to solve this perplexing riddle, but after an hour of arguing, we just laughed and toasted marshmallows instead."
    }
  },
  {
    "id": "143",
    "word": "lively",
    "word_meaning": "full of energy and enthusiasm",
    "difficulty_level": "easy",
    "passages": {
      "15": "Her lively stories about Paris kept us glued to our seats.",
      "30": "You should’ve heard Sarah’s lively tales about her Paris trip; she had us laughing and gasping, totally forgetting the boring office meeting we’d just left."
    }
  },
  {
    "id": "145",
    "word": "cozy",
    "word_meaning": "giving a feeling of comfort, warmth, and relaxation",
    "difficulty_level": "easy",
    "passages": {
      "15": "That little bookstore felt so cozy, I stayed for hours.",
      "30": "You’d love this cozy bookstore I found; it’s got soft chairs, warm lights, and the smell of old books that just makes you want to stay forever."
    }
  },
  {
    "id": "146",
    "word": "facetious",
    "word_meaning": "treating serious issues with deliberately inappropriate humor",
    "difficulty_level": "hard",
    "passages": {
      "15": "His facetious joke about the deadline annoyed the boss.",
      "30": "So, Mike drops this facetious quip about missing the deadline, and his facetious grin just makes the boss fume, while we’re all trying not to laugh."
    }
  },
  {
    "id": "148",
    "word": "audacious",
    "word_meaning": "showing bold or daring confidence, often recklessly",
    "difficulty_level": "hard",
    "passages": {
      "15": "Her audacious plan to crash the gala shocked us.",
      "30": "Okay, Lisa’s audacious idea to sneak into the fancy gala was wild; her audacious confidence had us all giggling nervously as she strutted in like she owned the place."
    }
  },
  {
    "id": "149",
    "word": "wry",
    "word_meaning": "using or expressing dry, mocking humor",
    "difficulty_level": "medium",
    "passages": {
      "15": "His wry comment about my cooking made everyone chuckle.",
      "30": "So, I burn the pie, and he gives this wry smirk, tossing a wry jab about my cooking skills, which had the whole table laughing despite the smoky kitchen."
    }
  },
  {
    "id": "150",
    "word": "merry",
    "word_meaning": "cheerful and lively, often associated with festivity",
    "difficulty_level": "easy",
    "passages": {
      "15": "The merry carolers sang joyfully, filling the snowy street with warmth.",
      "30": "On the frosty evening, merry carolers roamed the village, their lively songs and jingling bells spreading cheer, as neighbors opened windows to join the festive melody."
    }
  },
  {
    "id": "154",
    "word": "perspicuous",
    "word_meaning": "clearly expressed, easy to understand despite complexity",
    "difficulty_level": "hard",
    "passages": {
      "15": "Her perspicuous explanation unraveled the theorem, astonishing the perplexed mathematicians.",
      "30": "In the lecture hall, her perspicuous breakdown of the arcane theorem cut through confusion, her precise words illuminating complex ideas, leaving scholars in awe under the dim chandelier."
    }
  },
  {
    "id": "155",
    "word": "tenebrous",
    "word_meaning": "dark, shadowy, obscure; difficult to perceive",
    "difficulty_level": "hard",
    "passages": {
      "15": "The tenebrous cavern hid secrets no explorer dared to uncover.",
      "30": "Deep within the tenebrous cavern, shadows cloaked ancient carvings, their eerie forms barely visible, whispering of forgotten rituals to the lone explorer braving the oppressive darkness."
    }
  },
  {
    "id": "156",
    "word": "obfuscatory",
    "word_meaning": "deliberately confusing or unclear; obscuring meaning",
    "difficulty_level": "hard",
    "passages": {
      "15": "His obfuscatory speech left the council baffled, unable to grasp his intentions.",
      "30": "In the dimly lit chamber, his obfuscatory rhetoric wove a tangled web of vague phrases, leaving council members frustrated, their questions unanswered amidst the flickering candlelight."
    }
  },
  {
    "id": "157",
    "word": "susurrus",
    "word_meaning": "a soft, whispering or rustling sound; a murmur",
    "difficulty_level": "hard",
    "passages": {
      "15": "A susurrus of leaves stirred the silence of the moonlit forest.",
      "30": "Through the moonlit forest, a susurrus of leaves whispered secrets, their gentle rustling blending with distant owls, creating an eerie chorus that chilled the lone wanderer’s heart."
    }
  },
  {
    "id": "158",
    "word": "caliginous",
    "word_meaning": "dark, misty, and gloomy; obscure",
    "difficulty_level": "hard",
    "passages": {
      "15": "The caliginous swamp swallowed light, unnerving even the boldest travelers.",
      "30": "In the caliginous swamp, dense mist curled around gnarled trees, obscuring paths as eerie silence and faint croaks unsettled travelers braving the oppressive, shadow-laden air."
    }
  },
  {
    "id": "159",
    "word": "syllogistic",
    "word_meaning": "relating to or consisting of a logical argument in two premises and a conclusion",
    "difficulty_level": "hard",
    "passages": {
      "15": "His syllogistic reasoning dismantled the opponent’s argument in the debate.",
      "30": "In the quiet hall, his syllogistic argument unfolded methodically, each premise building to a conclusion that silenced opponents, their rebuttals crumbling under his logical precision."
    }
  },
  {
    "id": "160",
    "word": "thaumaturgic",
    "word_meaning": "having or displaying miraculous or magical powers",
    "difficulty_level": "hard",
    "passages": {
      "15": "The sage’s thaumaturgic aura captivated the village, sparking whispers of magic.",
      "30": "Under starlight, the sage’s thaumaturgic presence enthralled the village, her gestures conjuring faint glimmers, as awestruck onlookers whispered of miracles woven in the night air."
    }
  },
  {
    "id": "161",
    "word": "crepuscular",
    "word_meaning": "resembling or relating to twilight; active at dusk or dawn",
    "difficulty_level": "hard",
    "passages": {
      "15": "Crepuscular shadows cloaked the meadow, where bats began their silent dance.",
      "30": "As crepuscular light bathed the meadow, bats emerged, their wings slicing through twilight’s haze, weaving silent patterns that mesmerized the lone watcher in the fading glow."
    }
  },
  {
    "id": "162",
    "word": "limpid",
    "word_meaning": "clear and transparent, especially in a pure or serene way",
    "difficulty_level": "hard",
    "passages": {
      "15": "Her limpid prose clarified the complex topic for all readers.",
      "30": "Her limpid writing illuminated the manuscript, each sentence flowing with serene clarity, transforming arcane theories into accessible truths under the soft glow of her desk lamp."
    }
  },
  {
    "id": "163",
    "word": "fuliginous",
    "word_meaning": "sooty, smoky, or dusky; obscured by darkness",
    "difficulty_level": "hard",
    "passages": {
      "15": "The fuliginous haze from the fire obscured the ancient ruins.",
      "30": "A fuliginous veil of smoke drifted over the ruins, cloaking stone carvings in shadow, as the acrid scent of charred wood haunted explorers in the dim twilight."
    }
  },
  {
    "id": "164",
    "word": "prolix",
    "word_meaning": "tediously prolonged or wordy; overly verbose",
    "difficulty_level": "hard",
    "passages": {
      "15": "His prolix lecture exhausted the audience, who craved brevity.",
      "30": "The professor’s prolix discourse rambled endlessly, piling dense jargon upon tangents, leaving students weary, their notebooks filled with words but starved for concise meaning."
    }
  },
  {
    "id": "165",
    "word": "epiphanic",
    "word_meaning": "relating to a sudden realization or insight",
    "difficulty_level": "hard",
    "passages": {
      "15": "An epiphanic moment struck her, revealing the solution at midnight.",
      "30": "Under the starry sky, an epiphanic spark ignited her mind, unveiling the puzzle’s answer, as the quiet night amplified her sudden clarity amidst the whispering pines."
    }
  },
  {
    "id": "166",
    "word": "tatterdemalion",
    "word_meaning": "ragged or disreputable in appearance; shabby",
    "difficulty_level": "hard",
    "passages": {
      "15": "The tatterdemalion wanderer shuffled through the village, unnoticed by most.",
      "30": "In tatterdemalion rags, the wanderer trudged through the village, his patched cloak flapping in the wind, ignored by all but the children who saw stories in his weathered face."
    }
  },
  {
    "id": "167",
    "word": "phlegmatic",
    "word_meaning": "having an unemotional or stolidly calm disposition",
    "difficulty_level": "hard",
    "passages": {
      "15": "His phlegmatic response to the crisis steadied the frantic crowd.",
      "30": "Amid the chaos, his phlegmatic calm anchored the group, his unemotional tone and steady gaze guiding them through the storm with quiet, unshakable resolve."
    }
  },
  {
    "id": "168",
    "word": "lachrymose",
    "word_meaning": "tearful or mournful; inclined to weep",
    "difficulty_level": "hard",
    "passages": {
      "15": "Her lachrymose demeanor at the farewell moved the stoic crowd.",
      "30": "At the station, her lachrymose farewell, eyes brimming with tears, softened the crowd, as the train’s whistle echoed, mingling with her sobs in the misty dawn air."
    }
  },
  {
    "id": "169",
    "word": "sesquipedalian",
    "word_meaning": "characterized by long words; polysyllabic",
    "difficulty_level": "hard",
    "passages": {
      "15": "His sesquipedalian speech bewildered the audience, craving simpler terms.",
      "30": "In the lecture, his sesquipedalian verbosity, packed with multisyllabic jargon, left listeners dazed, scribbling incomprehensible terms as the chandelier’s light flickered over their puzzled faces."
    }
  },
  {
    "id": "170",
    "word": "coruscating",
    "word_meaning": "flashing or sparkling brilliantly; highly incisive or witty",
    "difficulty_level": "hard",
    "passages": {
      "15": "Her coruscating wit lit up the dull debate, startling everyone.",
      "30": "Amid the tedious debate, her coruscating quips sparkled, slicing through arguments with brilliant humor, as the room erupted in laughter under the glow of ornate lamps."
    }
  },
  {
    "id": "171",
    "word": "evanescent",
    "word_meaning": "quickly fading or disappearing; fleeting",
    "difficulty_level": "hard",
    "passages": {
      "15": "The evanescent mist vanished, revealing the valley’s hidden beauty.",
      "30": "As dawn broke, the evanescent mist dissolved swiftly, unveiling a valley where dew glistened on wildflowers, their fleeting shimmer captivating hikers in the quiet morning light."
    }
  },
  {
    "id": "172",
    "word": "oneiric",
    "word_meaning": "relating to dreams or dreamlike states",
    "difficulty_level": "hard",
    "passages": {
      "15": "The painting’s oneiric imagery blurred reality, entrancing viewers.",
      "30": "In the gallery, the oneiric canvas wove dreamlike scenes, its surreal colors and shapes pulling viewers into a hazy realm where reality and fantasy merged under soft lights."
    }
  },
  {
    "id": "173",
    "word": "sempiternal",
    "word_meaning": "eternal and unchanging; everlasting",
    "difficulty_level": "hard",
    "passages": {
      "15": "The sempiternal stars shone steadily above the restless world.",
      "30": "High above the shifting desert, sempiternal stars gleamed unchanging, their ancient light a quiet comfort to nomads who navigated by their glow through endless, windswept nights."
    }
  },
  {
    "id": "174",
    "word": "parsimonious",
    "word_meaning": "excessively frugal or stingy; sparing in expenditure",
    "difficulty_level": "hard",
    "passages": {
      "15": "His parsimonious habits frustrated the team, who needed resources.",
      "30": "His parsimonious refusal to fund supplies baffled the crew, who watched him hoard coins while the expedition faltered, their tools worn and spirits dimmed in the harsh wilderness."
    }
  },
  {
    "id": "175",
    "word": "numinous",
    "word_meaning": "having a mysterious, spiritual, or supernatural quality",
    "difficulty_level": "hard",
    "passages": {
      "15": "The numinous aura of the shrine silenced the weary pilgrims.",
      "30": "In the ancient shrine, a numinous glow seemed to pulse from the stones, hushing pilgrims who felt an otherworldly presence linger in the cool, sacred air."
    }
  },
  {
    "id": "176",
    "word": "antipodean",
    "word_meaning": "relating to the opposite side of the world; diametrically opposed",
    "difficulty_level": "hard",
    "passages": {
      "15": "Their antipodean perspectives clashed fiercely during the global summit.",
      "30": "At the summit, their antipodean views sparked heated debate, each delegate’s stance so opposed that the room buzzed with tension under the glow of international flags."
    }
  },
  {
    "id": "177",
    "word": "chthonic",
    "word_meaning": "relating to or inhabiting the underworld; subterranean",
    "difficulty_level": "hard",
    "passages": {
      "15": "The chthonic myths whispered of spirits beneath the earth’s surface.",
      "30": "In the village, chthonic tales of underworld spirits haunted listeners, their eerie whispers of subterranean realms echoing in the firelight as shadows danced on cave walls."
    }
  },
  {
    "id": "178",
    "word": "obstreperous",
    "word_meaning": "noisy and difficult to control; stubbornly resistant",
    "difficulty_level": "hard",
    "passages": {
      "15": "The obstreperous crowd’s shouts disrupted the solemn ceremony.",
      "30": "During the quiet ritual, the obstreperous mob’s raucous chants echoed, their defiant clamor drowning out prayers, as torchlight flickered over their unruly faces in the twilight."
    }
  },
  {
    "id": "179",
    "word": "diaphanous",
    "word_meaning": "light, delicate, and translucent; almost transparent",
    "difficulty_level": "hard",
    "passages": {
      "15": "Her diaphanous veil floated ethereally in the evening breeze.",
      "30": "At the gala, her diaphanous gown shimmered, its translucent fabric catching moonlight, drifting like mist as she glided across the marble floor, captivating all onlookers."
    }
  },
  {
    "id": "180",
    "word": "propinquity",
    "word_meaning": "proximity or nearness; kinship or similarity",
    "difficulty_level": "hard",
    "passages": {
      "15": "Their propinquity in the village fostered an unexpected alliance.",
      "30": "Living in propinquity, the neighbors formed a bond, their shared evenings by the hearth weaving a kinship that turned strangers into allies under the starry rural sky."
    }
  },
  {
    "id": "181",
    "word": "effulgent",
    "word_meaning": "shining brilliantly; radiant",
    "difficulty_level": "hard",
    "passages": {
      "15": "The effulgent sunrise painted the horizon with golden brilliance.",
      "30": "As the effulgent dawn broke, golden rays bathed the cliffs, their radiant glow reflecting off the sea, awakening the sleepy village with a burst of dazzling light."
    }
  },
  {
    "id": "182",
    "word": "pervicacious",
    "word_meaning": "extremely willful or stubborn; obstinate",
    "difficulty_level": "hard",
    "passages": {
      "15": "His pervicacious refusal baffled the negotiators seeking compromise.",
      "30": "In the tense council, his pervicacious stance against change, unyielding as stone, frustrated mediators, who watched him stand firm amidst the flickering lanterns of the chamber."
    }
  },
  {
    "id": "183",
    "word": "plangent",
    "word_meaning": "loud and resonant, with a mournful or plaintive quality",
    "difficulty_level": "hard",
    "passages": {
      "15": "The plangent toll of the bell mourned the village’s loss.",
      "30": "Echoing across the valley, the plangent bell’s mournful chime rang out, its resonant sorrow piercing the fog, as villagers gathered silently to honor their fallen kin."
    }
  },
  {
    "id": "184",
    "word": "impecunious",
    "word_meaning": "having little or no money; penniless",
    "difficulty_level": "hard",
    "passages": {
      "15": "The impecunious artist painted masterpieces despite his poverty.",
      "30": "Though impecunious, the artist crafted stunning works in his cramped attic, using scavenged paints, his genius shining through tattered clothes under the dim glow of a single candle."
    }
  },
  {
    "id": "185",
    "word": "lambent",
    "word_meaning": "softly glowing or flickering; gently radiant",
    "difficulty_level": "hard",
    "passages": {
      "15": "Lambent flames danced softly, casting a glow over the campsite.",
      "30": "By the quiet river, lambent flames flickered gently, their soft glow warming the campsite, where weary travelers shared tales under the delicate light of a starry night."
    }
  },
  {
    "id": "186",
    "word": "rebarbative",
    "word_meaning": "repellent or irritating; unattractive",
    "difficulty_level": "hard",
    "passages": {
      "15": "His rebarbative tone alienated even his closest allies.",
      "30": "With a rebarbative sneer, he dismissed their ideas, his grating voice and harsh words echoing in the hall, driving away allies under the cold glare of chandeliers."
    }
  },
  {
    "id": "187",
    "word": "tintinnabulation",
    "word_meaning": "the ringing or sounding of bells",
    "difficulty_level": "hard",
    "passages": {
      "15": "The tintinnabulation of church bells echoed through the misty valley.",
      "30": "At dusk, the tintinnabulation of ancient bells rang out, their clear chimes cutting through mist, drawing villagers to the old church in the quiet, fog-shrouded valley."
    }
  },
  {
    "id": "188",
    "word": "solivagant",
    "word_meaning": "rambling alone : marked by solitary wandering",
    "difficulty_level": "hard",
    "passages": {
      "15": "The solivagant traveler roamed forgotten paths, seeking solitude in the wilderness.",
      "30": "As a solivagant soul, he wandered misty trails alone, the crunch of leaves underfoot his only companion, finding peace in the solitary whispers of ancient forests at dusk."
    }
  },
  {
    "id": "189",
    "word": "filipendulous",
    "word_meaning": "suspended by or strung upon a thread",
    "difficulty_level": "hard",
    "passages": {
      "15": "The filipendulous ornament swayed gently from the fragile silk thread.",
      "30": "In the quiet atelier, the filipendulous crystal dangled from a slender thread, catching sunlight and casting rainbows, as the artisan admired its delicate balance in the breeze."
    }
  },
  {
    "id": "190",
    "word": "deipnosophist",
    "word_meaning": "a person skilled in table talk",
    "difficulty_level": "hard",
    "passages": {
      "15": "The deipnosophist charmed guests with witty anecdotes over dinner.",
      "30": "At the lavish banquet, the deipnosophist wove tales seamlessly, his eloquent banter sparking laughter, as candlelight flickered over faces enthralled by his conversational artistry."
    }
  },
  {
    "id": "191",
    "word": "scripturient",
    "word_meaning": "having a strong urge to write",
    "difficulty_level": "hard",
    "passages": {
      "15": "The scripturient author filled notebooks with endless ideas at midnight.",
      "30": "Driven by scripturient passion, she scribbled furiously in her attic, ink staining her fingers, as the moonlit window framed her relentless pursuit of capturing fleeting thoughts."
    }
  },
  {
    "id": "192",
    "word": "penultimatum",
    "word_meaning": "a demand or proposal approaching an ultimatum",
    "difficulty_level": "hard",
    "passages": {
      "15": "His penultimatum warned of consequences if negotiations failed soon.",
      "30": "In the tense boardroom, his penultimatum hung heavy, a near-final demand echoing amid whispers, as clocks ticked and executives weighed the looming threat under dim lights."
    }
  },
  {
    "id": "193",
    "word": "matutinal",
    "word_meaning": "of, relating to, or occurring in the morning",
    "difficulty_level": "hard",
    "passages": {
      "15": "Her matutinal routine included yoga as dawn broke softly.",
      "30": "In the matutinal hush, she practiced yoga on the dew-kissed grass, the rising sun warming her face, infusing her day with serene energy amid chirping birds."
    }
  },
  {
    "id": "194",
    "word": "make-bate",
    "word_meaning": "one that excites contention and quarrels",
    "difficulty_level": "hard",
    "passages": {
      "15": "The make-bate stirred discord among the once-harmonious group.",
      "30": "As a notorious make-bate, he sowed seeds of argument at gatherings, his sly remarks igniting feuds, while shadows lengthened and tempers flared in the crowded hall."
    }
  },
  {
    "id": "195",
    "word": "empleomania",
    "word_meaning": "a mania for holding public office",
    "difficulty_level": "hard",
    "passages": {
      "15": "His empleomania drove him to campaign relentlessly for every position.",
      "30": "Fueled by empleomania, he pursued offices with unyielding zeal, his speeches echoing in town squares, as crowds gathered under banners, drawn to his ambitious fervor."
    }
  },
  {
    "id": "196",
    "word": "noctivagant",
    "word_meaning": "going about in the night : night-wandering",
    "difficulty_level": "hard",
    "passages": {
      "15": "The noctivagant figure slipped through shadows, unseen by all.",
      "30": "As a noctivagant wanderer, he roamed moonlit streets, the city's hush broken only by distant owls, his footsteps echoing mysteries in the velvet embrace of night."
    }
  },
  {
    "id": "197",
    "word": "agathokakological",
    "word_meaning": "composed of both good and evil",
    "difficulty_level": "hard",
    "passages": {
      "15": "The agathokakological character intrigued readers with moral ambiguity.",
      "30": "In the tale, the agathokakological hero balanced virtue and vice, his actions a tapestry of light and shadow, captivating audiences under the spell of flickering firelight."
    }
  },
  {
    "id": "198",
    "word": "bustle",
    "word_meaning": "move in an energetic or noisy manner",
    "difficulty_level": "easy",
    "passages": {
      "15": "The market bustled with shoppers haggling over colorful wares.",
      "30": "In the vibrant market, shoppers bustled through crowded stalls, their voices blending with clinking coins and the scent of spices, creating a lively hum under the morning sun."
    }
  },
  {
    "id": "199",
    "word": "glimmer",
    "word_meaning": "shine faintly with a wavering light",
    "difficulty_level": "easy",
    "passages": {
      "15": "Stars glimmered faintly above the quiet, darkened valley.",
      "30": "Above the hushed valley, stars glimmered softly, their wavering light casting a gentle glow, guiding wanderers through the cool night as crickets sang in the distance."
    }
  },
  {
    "id": "200",
    "word": "hasten",
    "word_meaning": "move or act quickly; hurry",
    "difficulty_level": "easy",
    "passages": {
      "15": "She hastened to the station, clutching her ticket tightly.",
      "30": "Clutching her ticket, she hastened through the crowded streets, dodging carts and weaving past vendors, her heart racing to catch the last train under the fading sunset."
    }
  },
  {
    "id": "201",
    "word": "murmur",
    "word_meaning": "a soft, low, or indistinct sound",
    "difficulty_level": "easy",
    "passages": {
      "15": "The stream’s gentle murmur soothed the weary travelers.",
      "30": "By the forest, the stream’s soft murmur lulled travelers, its quiet ripples blending with rustling leaves, creating a peaceful haven under the canopy of twinkling stars."
    }
  },
  {
    "id": "202",
    "word": "saunter",
    "word_meaning": "walk in a slow, relaxed manner",
    "difficulty_level": "easy",
    "passages": {
      "15": "He sauntered through the park, enjoying the warm breeze.",
      "30": "He sauntered lazily through the park, hands in pockets, as the warm breeze carried scents of blooming flowers, his carefree steps matching the rhythm of a sunny afternoon."
    }
  },
  {
    "id": "203",
    "word": "kindle",
    "word_meaning": "start a fire; ignite or inspire",
    "difficulty_level": "easy",
    "passages": {
      "15": "Her words kindled hope in the discouraged team.",
      "30": "Her passionate speech kindled a spark in the team, their doubts fading as her words, warm as a hearth, inspired them to rise and face the challenge anew."
    }
  },
  {
    "id": "204",
    "word": "gaze",
    "word_meaning": "look steadily and intently, especially in admiration",
    "difficulty_level": "easy",
    "passages": {
      "15": "She gazed at the sunset, lost in its fiery beauty.",
      "30": "She gazed at the horizon, where the sunset’s fiery hues painted the sky, her eyes tracing each vibrant streak as the evening breeze whispered through the quiet hills."
    }
  },
  {
    "id": "205",
    "word": "ramble",
    "word_meaning": "walk for pleasure without a definite route",
    "difficulty_level": "easy",
    "passages": {
      "15": "They rambled through the meadows, carefree under the sun.",
      "30": "They rambled through golden meadows, their laughter mingling with birdsong, as wildflowers brushed their legs and the warm sun guided their aimless, joyful path."
    }
  },
  {
    "id": "206",
    "word": "flicker",
    "word_meaning": "shine unsteadily or waver; a brief movement",
    "difficulty_level": "easy",
    "passages": {
      "15": "The candle’s flicker cast dancing shadows on the walls.",
      "30": "In the cozy cabin, the candle’s flicker sent shadows dancing across wooden walls, their wavering glow creating a warm, fleeting magic as the storm howled outside."
    }
  },
  {
    "id": "207",
    "word": "linger",
    "word_meaning": "stay longer than necessary, often due to reluctance",
    "difficulty_level": "easy",
    "passages": {
      "15": "She lingered by the lake, reluctant to leave its calm.",
      "30": "By the serene lake, she lingered, her heart hesitant to depart, as the water’s gentle lapping and the scent of pine held her in a tranquil, timeless embrace."
    }
  },
  {
    "id": "208",
    "word": "drift",
    "word_meaning": "be carried slowly by a current or breeze",
    "difficulty_level": "easy",
    "passages": {
      "15": "Leaves drifted lazily down the stream, catching the sunlight.",
      "30": "Golden leaves drifted along the quiet stream, their slow dance sparkling in the sunlight, as the gentle current carried them past mossy rocks under a serene autumn sky."
    }
  },
  {
    "id": "209",
    "word": "sparkle",
    "word_meaning": "shine brightly with flashes of light",
    "difficulty_level": "easy",
    "passages": {
      "15": "Dewdrops sparkled on the grass, glowing in the morning light.",
      "30": "At dawn, dewdrops sparkled across the meadow, their tiny prisms catching the sun’s rays, casting fleeting rainbows that enchanted early risers strolling through the cool grass."
    }
  },
  {
    "id": "210",
    "word": "sway",
    "word_meaning": "move or swing back and forth gently",
    "difficulty_level": "easy",
    "passages": {
      "15": "The trees swayed softly in the warm summer breeze.",
      "30": "In the orchard, trees swayed gently, their branches rustling in the warm breeze, casting dappled shadows on the ground as the scent of ripe apples filled the air."
    }
  },
  {
    "id": "211",
    "word": "whisper",
    "word_meaning": "speak or say something very softly",
    "difficulty_level": "easy",
    "passages": {
      "15": "She whispered secrets to her friend under the moonlight.",
      "30": "Under the glowing moon, she whispered secrets to her friend, their soft voices blending with the night’s quiet, as stars twinkled above the hushed, silver-lit garden."
    }
  },
  {
    "id": "212",
    "word": "stroll",
    "word_meaning": "walk in a leisurely or relaxed way",
    "difficulty_level": "easy",
    "passages": {
      "15": "They strolled along the beach, enjoying the crashing waves.",
      "30": "They strolled hand-in-hand along the sandy beach, waves crashing rhythmically, as the salty breeze and seagull cries wrapped them in a carefree, sunlit moment."
    }
  },
  {
    "id": "213",
    "word": "gleam",
    "word_meaning": "shine brightly, especially with reflected light",
    "difficulty_level": "easy",
    "passages": {
      "15": "The polished wood gleamed under the soft lantern light.",
      "30": "In the cozy cabin, polished wood gleamed warmly under lantern light, its rich glow reflecting off walls, creating a snug haven as rain tapped the windows outside."
    }
  },
  {
    "id": "214",
    "word": "dash",
    "word_meaning": "run or move quickly and suddenly",
    "difficulty_level": "easy",
    "passages": {
      "15": "He dashed across the field to catch the runaway kite.",
      "30": "With a shout, he dashed across the windy field, chasing the runaway kite, its bright tail dancing just out of reach as laughter echoed under the wide sky."
    }
  },
  {
    "id": "215",
    "word": "soothe",
    "word_meaning": "gently calm or relieve",
    "difficulty_level": "easy",
    "passages": {
      "15": "Her soft lullaby soothed the restless child to sleep.",
      "30": "Singing a soft lullaby, she soothed the fussy child, her gentle voice blending with the night’s calm, as moonlight streamed through the window, lulling them to sleep."
    }
  },
  {
    "id": "216",
    "word": "twinkle",
    "word_meaning": "shine with a flickering or sparkling light",
    "difficulty_level": "easy",
    "passages": {
      "15": "Fireflies twinkled in the meadow, delighting the evening walkers.",
      "30": "In the dusky meadow, fireflies twinkled like tiny stars, their flickering glow enchanting walkers, who paused to watch the delicate dance amid the sweet scent of clover."
    }
  },
  {
    "id": "217",
    "word": "wander",
    "word_meaning": "move or travel aimlessly without a fixed destination",
    "difficulty_level": "easy",
    "passages": {
      "15": "He wandered through the forest, lost in its quiet beauty.",
      "30": "He wandered through the dense forest, moss cushioning his steps, as birdsong and the scent of pine guided his aimless path under the cool, dappled canopy."
    }
  }
]
